# Day 06 - Python Pandas

This includes:
1. Pandas Dataframe
2. Pandas Series
3. Pandas Basic Operations

In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\uzair hussain\appdata\local\programs\python\python311\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\uzair hussain\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\uzair hussain\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\uzair hussain\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\uzair hussain\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\uzair hussain\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
import pandas as pd
import numpy as np

In [5]:
# np.array([1,2,3,4,5])
arr = np.arange(0,20).reshape(5,4)
# it expects a 2D array and works as a matrix

In [6]:
df = pd.DataFrame(arr,index = ['1','2','3','4','5'],columns = ['A','B','C','D'])
df
# it takes an arr ,and index and columns as arguments

    A   B   C   D
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15
5  16  17  18  19

In [7]:
# Creating a datafram
df1 = pd.DataFrame(np.arange(0, 30).reshape(6,5), index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5', 'Row6'], columns=['Column1', 'Column2', 'Column3', 'Column4', 'Column5'])
df1

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24
Row6       25       26       27       28       29

In [8]:
df.head()

    A   B   C   D
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15
5  16  17  18  19

In [9]:
df1.head()

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24

In [10]:
df.tail()

    A   B   C   D
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15
5  16  17  18  19

In [11]:
df1.tail()

      Column1  Column2  Column3  Column4  Column5
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24
Row6       25       26       27       28       29

In [12]:
# saving df in csv file
df.to_csv('Data.csv')

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int32
 1   B       5 non-null      int32
 2   C       5 non-null      int32
 3   D       5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [15]:
df.describe()

               A          B          C          D
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Row1 to Row6
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  6 non-null      int32
 1   Column2  6 non-null      int32
 2   Column3  6 non-null      int32
 3   Column4  6 non-null      int32
 4   Column5  6 non-null      int32
dtypes: int32(5)
memory usage: 168.0+ bytes

In [17]:
df1.describe()

         Column1    Column2    Column3    Column4    Column5
count   6.000000   6.000000   6.000000   6.000000   6.000000
mean   12.500000  13.500000  14.500000  15.500000  16.500000
std     9.354143   9.354143   9.354143   9.354143   9.354143
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     6.250000   7.250000   8.250000   9.250000  10.250000
50%    12.500000  13.500000  14.500000  15.500000  16.500000
75%    18.750000  19.750000  20.750000  21.750000  22.750000
max    25.000000  26.000000  27.000000  28.000000  29.000000

In [19]:
# Indexing in dataframes, we can achive using two methods
# using column number and ror index number

# columnname,rowindex[loc],rowindex,columnindex number[.iloc]
df1.head()

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24

In [20]:
df1[['Column1','Column2']]

      Column1  Column2
Row1        0        1
Row2        5        6
Row3       10       11
Row4       15       16
Row5       20       21
Row6       25       26

In [21]:
df1['Column1']

Row1     0
Row2     5
Row3    10
Row4    15
Row5    20
Row6    25
Name: Column1, dtype: int32

In [24]:
type(df1['Column1'])
# this will give you as series becuase it is a single column.

pandas.core.series.Series

- **Series**:  in this there is onlu single columns or single row.
- **Dataframe**: in this there will be multiple rows and mutiple columns.

In [26]:
type(df1[['Column1','Column2']])
# this will give you as dataframe becuase it is a multiple column.

pandas.core.frame.DataFrame

In [29]:
df1.head()

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24

In [28]:
# to access using rows we use loc function
df1.loc['Row3']

Column1    10
Column2    11
Column3    12
Column4    13
Column5    14
Name: Row3, dtype: int32

In [30]:
type(df1.loc['Row3'])

pandas.core.series.Series

In [31]:
df1.loc[['Row2','Row4']]

      Column1  Column2  Column3  Column4  Column5
Row2        5        6        7        8        9
Row4       15       16       17       18       19

In [32]:
type(df1.loc[['Row2','Row4']])

pandas.core.frame.DataFrame

In [33]:
# why we use loc and iloc function
# loc is label based indexing, and it shows the data of the label
# iloc is integer based indexing, and it shows the data of the index

df1.head()

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24

In [40]:
df1.iloc[1:3,0:2] # it will give data from 2nd row to 3rd row and 0th column to 1st column
# its index work as i-1 as actual

      Column1  Column2
Row2        5        6
Row3       10       11

In [42]:
df1.iloc[1:4,0:3]

      Column1  Column2  Column3
Row2        5        6        7
Row3       10       11       12
Row4       15       16       17

In [43]:
df1.iloc[2:,0:]

      Column1  Column2  Column3  Column4  Column5
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24
Row6       25       26       27       28       29

In [46]:
# selecting 0th and last column and all rows
df.iloc[0:,[0,3]]

    A   D
1   0   3
2   4   7
3   8  11
4  12  15
5  16  19

In [47]:
df.iloc[:,1:]

    B   C   D
1   1   2   3
2   5   6   7
3   9  10  11
4  13  14  15
5  17  18  19

In [48]:
# converting datafram into arrays
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [49]:
# Basic Operations in Dataframes
df1.head()

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24

In [50]:
df1.isnull()

      Column1  Column2  Column3  Column4  Column5
Row1    False    False    False    False    False
Row2    False    False    False    False    False
Row3    False    False    False    False    False
Row4    False    False    False    False    False
Row5    False    False    False    False    False
Row6    False    False    False    False    False

In [51]:
df1.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
Column5    0
dtype: int64

In [55]:
import numpy as np

In [56]:
df2 = pd.DataFrame(data=[[1,np.nan,2],[1,3,4]], index=['Row1', 'Row2'], columns=['Column1', 'Column2', 'Column3'])

In [57]:
df2

      Column1  Column2  Column3
Row1        1      NaN        2
Row2        1      3.0        4

In [58]:
df2.isnull().sum()

Column1    0
Column2    1
Column3    0
dtype: int64

In [62]:
df2.isnull().sum()==0

Column1     True
Column2    False
Column3     True
dtype: bool

In [67]:

df2['Column2'].value_counts()

Column2
3.0    1
Name: count, dtype: int64

In [69]:
df1['Column2'].unique()

array([ 1,  6, 11, 16, 21, 26])

In [72]:
df1[df1['Column2']>2]

      Column1  Column2  Column3  Column4  Column5
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24
Row6       25       26       27       28       29